In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [3]:
#Loading the required datasets

results_2023 = pd.read_csv('../data/2023_results.csv')
races_2023 = pd.read_csv('../data/2023_races.csv')
results_2024 = pd.read_csv('../data/2024_results.csv')
races_2024 = pd.read_csv('../data/2024_races.csv')
boston_men = pd.read_csv('../data/boston_men.csv')
boston_women = pd.read_csv('../data/boston_women.csv')
survey_summary = pd.read_csv('../data/survey_summary.csv')

In [5]:
results_2023.head()

,Name,Race,Year,Gender,Age,Finish,Age Bracket
0,Arunas Jurkus,Salt Lake City Marathon,2023,M,55,12907,55-59
1,Seth Reed,Salt Lake City Marathon,2023,M,24,12921,Under 35
2,Mufaro Chivasa,Salt Lake City Marathon,2023,M,54,12948,50-54
3,Adam Cheney,Salt Lake City Marathon,2023,M,22,12954,Under 35
4,Michael Pyles,Salt Lake City Marathon,2023,M,33,12964,Under 35

In [6]:
results_2024.head()

,Name,Race,Year,Gender,Finish,Age Group
0,Zouhair Talbi,Houston Marathon,2024,Men,7599,25-29
1,Tsedat Ayana,Houston Marathon,2024,Men,7620,25-29
2,Hendrik Pfeiffer,Houston Marathon,2024,Men,7634,30-34
3,Pat Tiernan,Houston Marathon,2024,Men,7665,25-29
4,Hugo Edgardo Catrileo Tapia,Houston Marathon,2024,Men,7724,25-29

We are missing 'Age' from the 2024 results dataset compared to the 2023 results. This will be dealt with later during cleaning.

In [7]:
races_2023.head()

                Race  Year      Date  Finishers
0       NYC Marathon  2023   11/5/23      51295
1   Chicago Marathon  2023   10/8/23      48574
2    Boston Marathon  2023   4/17/23      26600
3        LA Marathon  2023   3/19/23      16973
4  Honolulu Marathon  2023  12/10/23      15044

In [8]:
races_2024.head()

                              Race  Year        Date  Finishers
0                 Houston Marathon  2024  2024-01-14       7180
1                 Atlanta Marathon  2024  2024-02-24       1582
2            Disney World Marathon  2024  2024-01-03      12710
3                  Carmel Marathon  2024  2024-04-13       1451
4  Jack and Jill Downhill Marathon  2024  2024-07-27        701

In [9]:
boston_men.head()

,Year,Winner,Country,Time,Distance (Miles),Distance (KM)
0,1897.0,John McDermott,United States,02:55:10,24.5,39.4
1,1898.0,Ronald MacDonald,Canada,02:42:00,24.5,39.4
2,1899.0,Lawrence Brignolia,United States,02:54:38,24.5,39.4
3,1900.0,Jack Caffery,Canada,02:39:44,24.5,39.4
4,1901.0,Jack Caffery,Canada,02:29:23,24.5,39.4

In [10]:
boston_women.head()

,Year,Winner,Country,Time,Distance (Miles),Distance (KM)
0,1966.0,Bobbi Gibb,United States,3:21:40,26.2,42.2
1,1967.0,Bobbi Gibb,United States,3:27:17,26.2,42.2
2,1968.0,Bobbi Gibb,United States,3:30:00,26.2,42.2
3,1969.0,Sara Mae Berman,United States,3:22:46,26.2,42.2
4,1970.0,Sara Mae Berman,United States,3:05:07,26.2,42.2

In [11]:
survey_summary.head()

  Category Subcategory  Value Type
0   Gender      Female     55    %
1   Gender        Male     43    %
2   Gender  Non-binary      2    %
3      Age    Under 25      7    %
4      Age       25-34     24    %

In [12]:
results_2023.isnull().sum()

Name           0
Race           0
Year           0
Gender         0
Age            0
Finish         0
Age Bracket    0
dtype: int64

In [13]:
results_2024.isnull().sum()

Name         0
Race         0
Year         0
Gender       0
Finish       0
Age Group    0
dtype: int64

In [16]:
races_2023.isnull().sum()

race         0
year         0
date         0
finishers    0
dtype: int64

In [17]:
races_2024.isnull().sum()

race         0
year         0
date         0
finishers    0
dtype: int64

In [18]:
boston_men.isnull().sum()

year                2
winner              2
country             2
time                2
distance_(miles)    2
distance_(km)       2
dtype: int64

In [19]:
boston_women.isnull().sum()

year                1
winner              1
country             1
time                1
distance_(miles)    0
distance_(km)       0
dtype: int64

There is a small number of missing values in the Boston Marathon Winners data. We will drop these rows safely in the cleaning phase since there are very few.

In [20]:
survey_summary.isnull().sum()

category       0
subcategory    0
value          0
type           0
dtype: int64

In [14]:
#All columns lowercase and replace sapaces with underscore

def clean_columns(df):
    df.columns = df.columns.str.lower().str.replace(' ', '_')
    return df

results_2023 = clean_columns(results_2023)
results_2024 = clean_columns(results_2024)
races_2023 = clean_columns(races_2023)
races_2024 = clean_columns(races_2024)
boston_men = clean_columns(boston_men)
boston_women = clean_columns(boston_women)
survey_summary = clean_columns(survey_summary)

In [15]:
#NaN for missing `Age` in 2024 results dataset

results_2024['age'] = np.nan

In [21]:
#Drop missing rows in Boston Marathon Datasets

boston_men.dropna(subset = ['year', 'winner', 'country', 'time'], inplace = True)
boston_women.dropna(subset = ['year', 'winner', 'country', 'time'], inplace = True)

In [23]:
#Standardize Columns for Consistency

boston_men = clean_columns(boston_men)
boston_women = clean_columns(boston_women)